#pragma once
/**
sn.h : minimal pointer based transient binary tree node
========================================================

Motivation
-----------

In order to duplicate at CSG/CSGNode level the old workflow geometry
(that goes thru GGeo/NNode) it is necessary to perform binary tree
manipulations equivalent to those done by npy/NTreeBuilder::UnionTree
in order to handle shapes such as G4Polycone.

However the old array based *snd/scsg* node approach with integer index
addressing lacks the capability to easily delete nodes making it unsuitable
for tree manipulations such as pruning and rearrangement that are needed
in order to flexibly create complete binary trees with any number of leaf nodes.

Hence the *sn* nodes are developed. Initially sn.h was used as transient
template for binary trees that are subsequently solidified into *snd* trees.
But have now moved all snd functionality over to sn. So can directly use
only sn and the old "WITH-SND" is removed.

sn ctor/dtor register/de-register from s_pool<sn,_sn>
-------------------------------------------------------

In order to convert active *sn* pointers into indices
on persisting have explictly avoided leaking ANY *sn* by
taking care to ALWAYS delete appropriately.
This means that can use the *sn* ctor/dtor to add/erase update
an std::map of active *sn* pointers keyed on a creation index.
This map allows the active *sn* pointers to be converted into
a contiguous set of indices to facilitate serialization.

Possible Future
-----------------

CSG_CONTIGUOUS could keep n-ary CSG trees all the way to the GPU

**/

#include <map>
#include <set>
#include <vector>
#include <sstream>
#include <iomanip>
#include <cassert>
#include <csignal>
#include <cstdint>
#include <functional>
#include <algorithm>

#include "ssys.h"
#include "OpticksCSG.h"
#include "scanvas.h"
#include "s_pa.h"
#include "s_bb.h"
#include "s_tv.h"
#include "s_pool.h"

//#include "s_csg.h" // DONT DO THAT : CIRCULAR
#include "st.h"      // complete binary tree math
#include "stra.h"    // glm transform utilities
#include "sgeomtools.h"

#include "NPFold.h"

struct _sn
{
    int  typecode ;     // 0
    int  complement ;   // 1
    int  lvid ;         // 2
    int  xform ;        // 3
    int  param ;        // 4
    int  aabb ;         // 5
    int  parent ;       // 6

#ifdef WITH_CHILD
    int  sibdex ;       // 7     0-based sibling index
    int  num_child ;    // 8
    int  first_child ;  // 9
    int  next_sibling ; // 10
    int  index ;        // 11
    int  depth ;        // 12
    int  note  ;        // 13
    int  coincide ;     // 14
    char label[16] ;    // 15,16,17,18
    static constexpr const char* ITEM = "19" ;
#else
    int  left ;         // 7
    int  right ;        // 8
    int  index ;        // 9
    int  depth ;        // 10
    int  note  ;        // 11
    int  coincide ;     // 12
    char label[16] ;    // 13,14,15,16
    static constexpr const char* ITEM = "17" ;
#endif

    std::string desc() const ;
    bool is_root() const ;
};

inline std::string _sn::desc() const
{
    std::stringstream ss ;
    ss << "_sn::desc "
       << " typecode " << std::setw(4) << typecode
       << " complement " << std::setw(1) << complement
       << " lvid " << std::setw(4) << lvid
       << " xform " << std::setw(4) << xform
       << " param " << std::setw(4) << param
       << " aabb " << std::setw(4) << aabb
       << " parent " << std::setw(4) << parent
#ifdef WITH_CHILD
       << " sx " << std::setw(4) << sibdex
       << " nc " << std::setw(4) << num_child
       << " fc " << std::setw(4) << first_child
       << " ns " << std::setw(4) << next_sibling
#else
       << " left " << std::setw(4) << left
       << " right " << std::setw(4) << right
#endif
       << " is_root " << ( is_root() ? "YES" : "NO " )
       ;
    std::string str = ss.str();
    return str ;
}

/**
